[MainMissions.M_dlc4_M7_Helping_is_its_own_reward MissionDefinition]
MissionDescription="Blake has given you the key to a Hyperion Corporate Gift Shop.  Time to see if all the blood, sweat and dead claptraps were worth it."
MissionGiver="Blake"
MissionName="Helping Is Its Own Reward... Wait No It Isn't!"
MissionSummary="Go to the Hyperion Corporate Gift Shop."
Objectives[0]=(ProgressMessage="Payment processed:")
TurnInDescription="Now this is a gift shop! This secret cache of weapons beats the hell out of some assorted snow globes, shot glasses and cuddly plush skags."

[MainMissions.M_dlc4_New_Contact MissionDefinition]
MissionDescription="Hyperion VP, Mr. Blake wants to meet the crew that 'accidentally' slaughtered his recon team. Whoops. Find him at Tartarus Station."
MissionGiver="Blake"
MissionName="New Contact"
MissionSummary="Meet with Blake at Tartarus Station."
Objectives[0]=(ProgressMessage="Blake contacted:")
TurnInDescription="Hyperion Corporation wants to hire you to take care of the claptrap situation!  Welcome to the rakk race!"

[SideMissions.M_dlc4_Go_Visit_Tannis MissionDefinition]
MissionDescription="Tannis has established a new research outpost in Tartarus Station, she would like for you to help her with another experiment...."
MissionGiver="Tannis"
MissionName="Go Visit Tannis"
MissionSummary="Talk to Tannis in her laboratory at Tartarus Station"
Objectives[0]=(ProgressMessage="Meet Tannis:")
TurnInDescription="Tannis is as mad as ever, time to find out what plans she has for you this time"

[SideMissions.M_dlc4_Repair_Trap_Clap MissionDefinition]
MissionDescription="Aww, that poor helpless claptrap is in need of repair. Find a toolbox and fix him up.  He's just a little wee one. What harm could he do?"
MissionGiver="Claptrap"
MissionName="It's A Trap... Clap"
MissionSummary="Repair the damaged claptrap."
Objectives[0]=(ProgressMessage="Repair kit:")
TurnInDescription="You took out that devious claptrap and you learned a valuable lesson: Never help anyone but yourself."

[SideMissions.M_dlc4_Shooting_Rakks_Barrel MissionDefinition]
MissionDescription="A horde of bandits has blocked off the pass to Sanders Gorge.  How can you possibly take them out? Oh look! Huge freaking gun turrets! Fix those turrets and sick'em on the bandits."
MissionGiver="Hyperion Tourist Information Board"
MissionName="Like Shootin' Rakk In A Barrel"
MissionSummary="Reactivate the gun turrets to clear out the bandit camp."
Objectives[0]=(ProgressMessage="Turret components:")
Objectives[1]=(ProgressMessage="Activate turrets:")
TurnInDescription="The path is cleared! Plus you fixed the turrets and gave the canyon a fresh coat of red paint."

[SideMissions.M_dlc4_Spa_Vs_Spa MissionDefinition]
MissionDescription="Sal, the owner and proprietor of the illustrious Hostel Sal, is sick and tired of losing customers to those dirtbags over at the Pipp Inn Spa.  Stealing the Pipp Inn's power source oughta put a damper on their sauna... figuratively speaking."
MissionGiver="Hyperion Tourist Information Board"
MissionName="Spa Vs. Spa"
MissionSummary="Cut power to the Pipp Inn spa."
Objectives[0]=(ProgressMessage="Spa Power Source:")
TurnInDescription="The Pipp Inn is out of commission. Unfortunately the door on the sauna was on a power lock.  Hope they brought plenty of water."

[SideMissions.M_side_dlc4_OneUpmanPipp MissionDefinition]
MissionDescription="That slimy puke Sal has gone too far! Pipp, owner and hotelier of the far nicer Pipp Inn Spa, wants revenge.  Shoving garbage in Hostel Sal's food delivery chute should level the playing field in the resort wars."
MissionGiver="Hyperion Tourist Information Board"
MissionName=" One-UpmanPipp"
MissionSummary="Find some garbage and stuff it in Hostel Sal's food chute."
Objectives[0]=(ProgressMessage="Garbage:")
Objectives[1]=(ProgressMessage="Garbage placed in chute:")
TurnInDescription="You've secretly replaced the food at the Hostel Sal cafeteria with dark, sparkling garbage... can their customers tell the difference?"

